Repository: EdronW/pl-PL
Catalog: 00a_preface.po
Languages: pl_pl

source: Preface
pl_pl: Przedmowa

source: Debian is a very successful operating system, which is pervasive in our digital lives more than people often imagine or are aware of. A few data points will suffice to make this clear. At the time of writing Debian is the most popular GNU/Linux variant among web servers: according to <ulink url="http://w3techs.com/">W3Techs</ulink>, more than 10% of the web is Debian-powered. Think about it: how many web sites would have you missed today without Debian? Onto more fascinating deployments, Debian is the operating system of choice on the International Space Station. Have you been following the work of ISS astronauts, maybe via the social network presence of NASA or other international organizations? Both the work in itself and the posts about it have been made possible by Debian. Countless companies, universities, and public administrations rely on Debian daily for their operations, delivering services to millions of users around the world... and its orbit!
pl_pl: Debian to bardzo udany system operacyjny, z którym wbrew pozorom i powszechnemu przekonaniu wielu ludzi, mamy bardzo często styczność w swoim życiu. Wystarczy przywołać kilka informacji, aby stało się to jasne. W czasie swojego powstawania, Debian był najbardziej popularną dystrybucją GNU/Linux dla serwerów: według <ulink url="http://w3techs.com/">W3Techs</ulink>,ponad 10% sieci działało w oparciu o Debiana. Zastanów się: ile stron nie odwiedziłbyś dzisiaj gdyby nie Debian? Jeśli chodzi o bardziej wyjątkowe zastosowania, Debian jest systemem wybranym przez Międzynarodową Stację Kosmiczną. Czy śledziłeś kiedyś pracę astronautów MKS, na przykład dzięki portalowi NASA czy innej międzynarodowej organizacji? Zarówno działanie samo w sobie jak i posty o nim były prawdopodobnie zasługą Debiana. Niezliczone firmy, uniwersytety i instytucje administracji publicznej używają codziennie Debiana do realizacji swoich zadań, dostarczając usługi milionom ludzi na całym świecie...i jego orbicie!

source: But Debian is much more than an operating system, no matter how complex, featureful, and reliable such a system could be. Debian is a vision of the freedoms that people should enjoy in a world where more and more of our daily activities depend on software. Debian is born from the cardinal Free Software idea that people should be in control of their computers, and not the other way around. People with enough software knowledge should be able to dismantle, modify, reassemble and share with others all the software that matters to them. It doesn't matter if the software is used for frivolous activities like posting pictures of kittens on the Web, or for potentially life-threatening tasks such as driving our cars and powering the medical devices which cure us; you should control it. People without in-depth software knowledge, them too, should enjoy those freedom: they should be put in condition to delegate to people of their choice, people they trust, the audit or modification of software-based devices on their behalf.
pl_pl: Ale Debian jest czymś więcej niż tylko systemem operacyjnym, nie ważne jak złożony, funkcjonalny i niezawodny miałby być taki system. Debian to wizja wolności, z której w świecie gdzie coraz więcej codziennych obowiązków opiera się na oprogramowaniu, ludzie powinni się cieszyć. Debian powstał w oparciu o kardynalną zasadę wolnego oprogramowania, według której to ludzie powinni mieć kontrolę nad swoimi komputerami, nie odwrotnie. Osoby posiadające wystarczającą wiedzę w zakresie oprogramowania powinny mieć możliwość do demontowania, modyfikowania, ponownego składania w całość oraz dzielenia się z innymi ludźmi wszystkimi programami, których potrzebują. Nie istotne jest czy oprogramowanie jest używane do tak niepoważnych czynności jak wysyłanie obrazków z kotami przez Internet, czy do potencjalnie zagrażających życiu zadań jak prowadzenie samochodu lub zasilanie urządzeń medycznych leczących ludzi; powinieneś mieć nad nim kontrole. Ci ludzie, którzy nie znają się na oprogramowaniu, również powinni cieszyć się tą wolnością: mieć możliwość delegowania wyznaczonym przez siebie, zaufanym osobom audytu lub modyfikacji w swoim imieniu urządzeń opartych na oprogramowaniu.

source: In the quest for the control of people over machines, Free operating systems play a fundamental role: you cannot be in full control of a computer device if you do not control its operating system. This is where Debian's main ambition comes from: producing the best, entirely Free operating system. For more than 20 years now, Debian has both developed a Free operating system and promoted a vision of Free Software around it. In so doing, Debian has set a very high bar for software freedom advocates around the world. Debian's decisions on matters of software licensing, for example, are routinely looked up to by international standard organizations, governments, and other Free Software projects, when deciding if something should be considered “free enough” or not.
pl_pl: W kwestii uzyskania kontroli ludzi nad maszynami, darmowe systemy operacyjne odgrywają fundamentalną rolę: nie możesz w pełni kontrolować maszyny, jeśli nie kontrolujesz jej systemu operacyjnego. To jest właśnie głównym celem Debiana: stworzenie najlepszego, całkowicie darmowego systemu operacyjnego. Przez ponad 20 lat, Debian rozwija zarówno darmowy system operacyjny, jak i wizję wolnego oprogramowania wokół niego. Dzięki temu, ustawił poprzeczkę wysoko ludziom, którzy głoszą wolność oprogramowania na świecie. Na przykład, decyzje Debiana w sprawie licencjonowania oprogramowania są stale sprawdzane przez międzynarodowe organizacje normalizacyjne, rządy i inne projekty wolnego oprogramowania, decydujące czy coś można uznać za "wystarczająco wolne" czy nie.

source: But this political vision is not yet enough to explain Debian's uniqueness. Debian is also a very peculiar social experiment, strongly attached to its independence. Think for a moment of other mainstream Free Software distributions, or even of popular <emphasis>proprietary</emphasis> operating systems. Chances are that you can associate each of them with a large company that is either the main development force behind the project, or at the very least the steward of all its non-development activities. Debian is different. Within the Debian Project volunteers pick on themselves the responsibilities of all the activities that are needed to keep Debian alive and kicking. The variety of those activities is stunning: from translations to system administration, from marketing to management, from conference organization to artwork design, from bookkeeping to legal issues, ... not to mention software packaging and development! Debian contributors take care of all of these.
pl_pl: Jednakże, przedstawienie tej politycznej wizji, nie jest jeszcze wystarczające aby wyjaśnić unikalność Debiana. Debian jest także mocno wyróżniającym się eksperymentem społecznym, bardzo przywiązanym do swojej niezależności. Pomyśl przez chwilę o innych mainstreamowych dystrybucjach wolnego oprogramowania lub nawet o popularnych <emphasis>zamkniętych</emphasis> systemach operacyjnych. Jest spora szansa, że będziesz mógł je powiązać z dużymi firmami, które są albo głównym motorem napędzającym rozwój projektu albo co najmniej organizatorem jego zadań nie związanych z rozwojem. Debian jest inny. Jego wolontariusze w tym czasie, podzielili między siebie odpowiedzialność za wszystkie obowiązki, które trzeba wykonywać by Debian mógł funkcjonować i się rozwijać. Różnorodność tych kompetencji jest oszałamiająca: od tłumaczeń do administrowania systemem, od marketingu do zarządzania, od organizowania konferencji do projektowania grafiki, od księgowości do zagadnień prawnych, nie wspominając o konfekcjonowaniu oprogramowania i rozwijaniu go! Uczestnicy projektu sprawują pieczę nad każdym z tym zagadnień.

source: As a first consequence of this radical form of independence, Debian needs and relies on a very diverse community of volunteers. Any skill in any of the above areas, or others you can imagine, can be invested into Debian and will be used to improve the project. A second consequence of Debian independence is that Debian's choices can be trusted not to be driven by the commercial interests of specific companies — interests that we have no guarantee will always be aligned with the goal of promoting people's control over machines, as too many recent examples in the tech news testify.
pl_pl: Pierwszą konsekwencją tej radykalnej formy niezależności, jest zapotrzebowanie i poleganie Debiana na różnorodnej społeczności wolontariuszy. Jakakolwiek umiejętność w powyższych obszarach lub innych, które sobie wymyślisz, może być wykorzystana w projekcie i użyta do jego ulepszenia. Drugą konsekwencją niezależności Debiana jest wiarygodność jego wyborów jako niezależnych od komercyjnych interesów konkretnych firm- przedsięwzięcia na które nie mamy poręczenia , są zawsze związane z promowaniem kontroli ludzi nad maszynami, o czym świadczy wiele ostatnich przykładów nowinek technicznych.

source: One last aspect contributes to Debian's uniqueness: the way in which the social experiment is run. Despite the folklore of being bureaucratic, decision making in Debian is in fact highly unstructured, almost anarchic. There exist clearly defined areas of responsibility within the project. People in charge of those areas are free to drive their own boat. As long as they keep up with the quality requirements agreed upon by the community, no one can tell them what to do or how to do their job. If you want to have a say on how something is done in Debian, you need to put yourself on the line and be ready to take the job on your shoulders. This peculiar form of meritocracy — which we sometimes call <emphasis>do-ocracy</emphasis> — is very empowering for contributors. Anyone with enough skills, time, and motivation can have a real impact on the direction the project is taking. This is testified by a population of about 1 000 official members of the Debian Project, and several thousands of contributors world-wide. It is no wonder that Debian is often credited as the largest community-driven Free Software project in existence.
pl_pl: Ostatni aspekt dotyczący unikalności Debiana: sposób w jaki ten eksperyment społeczny funkcjonuje. Pomimo biurokratycznego folkloru, podejmowanie decyzji w projekcie jest bardzo nieuporządkowane, prawie anarchiczne. Istnieją jasno określone obowiązki wewnątrz projektu, ale ludzie odpowiedzialni za nie, nie są ograniczeni w swojej pracy. Dopóki trzymają się wymagań jakościowych zatwierdzonych przez społeczność, nikt nie może im mówić co mają robić, jak wykonywać swoją pracę. Jeśli chcesz mieć jakiś wpływ na to, jak dana rzecz zostanie wykonana, musisz spróbować swoich sił i być gotowym na wzięcie ciężaru pracy na własne barki. Ta szczególna forma merytokracji- którą czasem nazywamy <emphasis>do-ocracy</emphasis> — jest bardzo inspirująca dla współuczestników. Każdy z wystarczającymi zdolnościami, czasem i motywacją może mieć znaczący wpływ na kierunek rozwoju projektu. Świadczy o tym około tysiąca oficjalnych członków Projektu Debiana jak i kilka tysięcy współuczestników na całym świecie. Bez wątpienia Debian jest trafnie uznawany za największy projekt wolnego oprogramowania prowadzony przez społeczność.

source: So Debian is quite unique. Are we the only ones noticing this? Definitely not. According to <ulink url="http://distrowatch.com/">DistroWatch</ulink> there are about 300 active Free Software distributions around. Half of that (about 140) are Debian <emphasis>derivatives</emphasis>. That means that they start from Debian, adapt it to fit the needs of their users — usually by adding, modifying, and rebuilding packages — and release the resulting product. In essence, derivatives apply the Free Software granted freedoms of modifying and redistributing copies not only to individual pieces of software, but to a distribution as a whole. The potential of reaching out to new Free Software users and contributors by the means of derivative distributions is huge. We believe that it is mainly thanks to that thriving ecosystem that Free Software is nowadays finally rivaling with proprietary software in fields which were historically considered hard to conquer, such as large desktop deployments. Debian sits at the root of the largest ecosystem of Free Software distributions in existence: even if you are not using Debian directly, and even if your distributor has not told you, chances are that you are benefiting right now from the work of the Debian community.
pl_pl: Tak więc Debian jest dość unikalny. Czy jesteśmy jedynymi osobami, które do zauważyły? Zdecydowanie nie. Według <ulink url="http://distrowatch.com/">DistroWatch</ulink> istnieje 300 aktywnych dystrybucji wolnego oprogramowania. Połowa z nich(około 140) jest pochodnymi <emphasis>Debiana</emphasis>. Oznacza to, że zaczęły być rozwijane z Debiana i przystosowały się do potrzeb swoich użytkowników-zazwyczaj poprzez dodawanie, modyfikowanie oraz przebudowywanie pakietów-i w rezultacie wypuszczenie produktu. W istocie, pochodne stosują się do gwarantowanej przez wolne oprogramowanie swobody modyfikowania i rozpowszechniania kopii nie tylko części oprogramowania, ale także dystrybucji jako całości. Możliwości wyjścia na przeciw nowym użytkownikom wolnego oprogramowania dzięki pochodnym dystrybucjom jest ogromna. Wierzymy, że głównie dzięki rozkwitającemu ekosystemowi, w którym obecnie nareszcie wolne oprogramowanie może rywalizować z oprogramowaniem prawnie zastrzeżonym, na polach, które historycznie uznawane były za trudne do podbicia, takie jak wdrożenie dużych desktopowych systemów. Debian jest korzeniem większego ekosystemu dystrybucji wolnego oprogramowania: nawet jeśli nie używasz go bezpośrednio, i nawet jeśli twój dostawca nie poinformował cię o tym, możliwe, że właśnie teraz korzystasz z pracy Debiana.

source: But Debian's uniqueness sometimes comes with unexpected consequences. A consequence of Debian's vision on digital freedoms has been the need of redefining what we mean by <emphasis>software</emphasis>. The Debian Project has since long realized that, as part of an operating system, you need to distribute a lot of non-software material: music, images, documentation, raw data, firmware, etc. But how do you apply <emphasis>software</emphasis> freedoms to that material? Should we have different requirements or should all material be held up to the same high standard of freedom? The Debian Project has decided for the latter: all material shipped as part of Debian should offer the same freedoms to its users. Such a radical philosophical position has far reaching effects. It means we cannot distribute non-free firmware, or artwork not meant to be used in commercial settings, or books that cannot be modified in order to avoid tarnishing (as book publishers folklore goes) the author/publisher reputation.
pl_pl: Ale z unikalności Debiana czasem wynikają nieprzewidziane konsekwencje. Następstwem wizji Debiana dotyczącej cyfrowej wolności jest potrzeba ponownego zdefiniowania pojęcia <emphasis>oprogramowanie</emphasis>. Projekt Debian od dawna zauważył, że jako część systemu operacyjnego, potrzeba rozprowadzać wiele materiałów nie będących oprogramowaniem software: muzykę, rysunki, dokumentacje, surowe dane, oprogramowanie integralne. Jak zastosować do tego wolość <emphasis>oprogramowania</emphasis>? Czy powinniśmy mieć inne wymagania, czy sprowadzić wszystkie materiały do tego samego wysokiego poziomu wolności? Projekt Debian zadecydował aby wszystkie materiały dostarczone jako część Debiana oferowały taką samą wolność użytkownikom. Taka rygorystyczna filozofia przyniosła znaczące efekty. Oznacza to, ze nie możemy dostarczać oprogramowania integralnego lub oprawy graficznej sprzecznego z ideą wolnego oprogramowania, nie wspominając o użytkowaniu w kontekście handlowym, lub książek, które nie będą mogły być modyfikowane aby uniknąć nadszerpnięciu(tak jak to głosi folklor publicystów) reputacji autora/publicysty.

source: The book you have in your hands is different. It's a <emphasis>free as in freedom</emphasis> book, a book which is up to Debian freedom standards for every aspects of your digital life. For a very long time, the scarce availability of books like this one has been a significant shortcoming of Debian. It meant that that there was little reading material that help spreading Debian and its values, while at the same time embodying those values and showing off their advantages. But it also meant, ironically, that we had little such material that we could distribute as part of Debian itself. This is the first reputable book to address this shortcoming. You can <command>apt-get install</command> this book, you can redistribute it, you can fork this book or, better, submit bug reports and patches for it, so that other in the future can benefit from your contributions. The “maintainers” of this book — who are also its authors — are longstanding members of the Debian Project, who grok the freedom ethos that permeates every aspect of Debian and know first-hand what it means to take on the responsibility for important parts of Debian. By releasing this Free book they are doing, once more, such a wonderful service to the Debian community.
pl_pl: Książka, którą masz w swoich dłoniach jest inna. Jest to książka<emphasis>w obronie wolności</emphasis>, która podlega pod standardy wolnościowe Debiana w każdym aspekcie życia cyfrowego. Przez długi czas, mała ilość książek tego typu była niedociągnięciem Debiana. Oznaczało to, że istniało mało materiałów do czytania, które pomagały rozprzestrzenić Debiana i jego wartości, a także urzeczywistnić te wartości i pokazać ich zalety. Ale to także znaczyło, ironicznie, że mięliśmy też mało tego typu materiału, który moglibyśmy dostarczać jako część Debiana. To pierwsza renomowana książka, która ma naprawić to niedociągnięcie. Możesz <command>apt-get install</command> tą książkę, rozpowszechniać ją, stworzyć jej inną dystrybucje lub najlepiej, zgłosić raport błędów i ich poprawki, dzięki czemu inni będą mogli w przyszłości skorzystać z twojego wkładu. Ludzie, którzy współtworzyli tą książkę-będący także jej autorami- są wieloletnimi członkami Projektu Debian, którzy czują wolnościowego ducha przenikającego każdy aspekt projektu i mają wiedzę z pierwszej ręki dotyczącą odpowiedzialności za ważne części Debiana. Poprzez publikacje tej darmowej książki kolejny raz przysłużyli się społeczności Debiana.

source: We hope you will enjoy this cornerstone of Debian reading Freedom as much as we did.
pl_pl: Mamy nadzieje, że spodobają ci się te wolnościowe podstawy Debiana tak samo jak nam.

source: November 2013
pl_pl: Listopad 2013

source: Stefano Zacchiroli (Debian Project Leader 2010-2013) and Lucas Nussbaum (Debian Project Leader 2013-incumbent)
pl_pl: Stefano Zacchiroli (Lider Projektu Debian 2010-2013) and Lucas Nussbaum (Lider Projektu Debian 2013-obecnie)
